74th/ch32v003-book-code/adc-wch_sdk/src/main.c
#include <ch32v00x.h>
#include <debug.h>

#define VRX_PIN GPIO_Pin_1
#define VRY_PIN GPIO_Pin_2

void NMI_Handler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void HardFault_Handler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void Delay_Init(void);
void Delay_Ms(uint32_t n);

int main(void)
{
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
  SystemCoreClockUpdate();
  Delay_Init();

  // SDI printf の有効化
  // ビルドフラグ SDI_PRINT=1 が必要
  // wlink sdi-print enable を実行し、USBシリアルをリスンする
  // SDI_Printf_Enable();

  // USART1 printf の有効化
  USART_Printf_Init(115200);

  printf("init\r\n");

  GPIO_InitTypeDef GPIO_InitStructure = {0};
  ADC_InitTypeDef ADC_InitStructure = {0};

  // GPIOにクロック供給
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1 | RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOA, ENABLE);

  // VRX PA1 - ADC1 CH1
  GPIO_InitStructure.GPIO_Pin = VRX_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  // VRX PA2 - ADC1 CH0
  GPIO_InitStructure.GPIO_Pin = VRY_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  ADC_DeInit(ADC1);
  // 単一のADCの変換を動かす（各チャンネルの連続変換はしない）
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = DISABLE;
  // 連続変換は無効
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
  // 外部トリガは無効
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  // 16bitのレジスタに10bitの変換結果を格納する
  // その時のアライメント
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  // 変換の数
  ADC_InitStructure.ADC_NbrOfChannel = 1;
  // 設定の反映
  ADC_Init(ADC1, &ADC_InitStructure);

  ADC_Calibration_Vol(ADC1, ADC_CALVOL_50PERCENT);
  ADC_Cmd(ADC1, ENABLE);

  // キャリブレーション
  ADC_ResetCalibration(ADC1);
  while (ADC_GetResetCalibrationStatus(ADC1))
    ;
  ADC_StartCalibration(ADC1);
  while (ADC_GetCalibrationStatus(ADC1))
    ;

  printf("start\r\n");

  int count = 0;

  while (1)
  {
    printf("loop %d\r\n", count++);

    // CH1 を読み取り
    ADC_RegularChannelConfig(ADC1, ADC_Channel_1, 1, ADC_SampleTime_241Cycles);
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);
    while (!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC))
      ;

    uint16_t x = ADC_GetConversionValue(ADC1);

    // CH2 を読み取り
    ADC_RegularChannelConfig(ADC1, ADC_Channel_0, 1, ADC_SampleTime_241Cycles);
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);
    while (!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC))
      ;

    uint16_t y = ADC_GetConversionValue(ADC1);

    printf("x: %d, y: %d\r\n", x, y);

    Delay_Ms(200);
  }
}

void NMI_Handler(void) {}
void HardFault_Handler(void)
{
  while (1)
  {
  }
}